IDEA Open Model
FatigueTypeOfPrestressingSteel Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Posttensioned reinforcement type
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum FatigueTypeOfPrestressingSteel
Public Enumeration FatigueTypeOfPrestressingSteel
Members
Member name | Value | Description
PostTensioningSingleStrandsInPlasticDucts | 0 |  Table 6.4N: Parameters for S-N curves of prestressing steel - row 2
PostTensioningStraightTendonsOrCurvedTendonsInPlasticDucts | 1 |  Table 6.4N: Parameters for S-N curves of prestressing steel - row 3
PostTensioningCurvedTendonsInSteelDucts | 2 |  Table 6.4N: Parameters for S-N curves of prestressing steel - row 4
PostTensioningSplicingDevices | 3 |  Table 6.4N: Parameters for S-N curves of prestressing steel - row 5
PreTensioning | 4 |  Table 6.4N: Parameters for S-N curves of prestressing steel - row 1
ExternalTendon | 5 |  Table 6.4N: Parameters for S-N curves of prestressing steel - special type
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace